In [1]:
import pandas as pd
import numpy as np

In [2]:
accepted = pd.read_csv('../data/accepted_2007_to_2018Q4.csv')[['loan_amnt','issue_d','title',
                                                               'last_fico_range_high','dti','zip_code','addr_state',
                                                               'emp_length','policy_code']]
rejected = pd.read_csv('../data/rejected_2007_to_2018Q4.csv')

C:\Users\aznan\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (0,19,49,59,118,129,130,131,134,135,136,139,145,146,147) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
accepted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2260701 entries, 0 to 2260700
Data columns (total 9 columns):
 #   Column                Dtype
---  ------                -----
 0   loan_amnt             float64
 1   issue_d               object
 2   title                 object
 3   last_fico_range_high  float64
 4   dti                   float64
 5   zip_code              object
 6   addr_state            object
 7   emp_length            object
 8   policy_code           float64
dtypes: float64(4), object(5)
memory usage: 155.2+ MB

In [4]:
rejected.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 9 columns):
 #   Column                Non-Null Count    Dtype
---  ------                --------------    -----
 0   Amount Requested      1048575 non-null  float64
 1   Application Date      1048575 non-null  object
 2   Loan Title            1048546 non-null  object
 3   Risk_Score            781631 non-null   float64
 4   Debt-To-Income Ratio  1048575 non-null  object
 5   Zip Code              1048531 non-null  object
 6   State                 1048554 non-null  object
 7   Employment Length     1026235 non-null  object
 8   Policy Code           1048575 non-null  int64
dtypes: float64(2), int64(1), object(6)
memory usage: 72.0+ MB

missingness

In [5]:
# accepted
for col in accepted.columns:
    print(f'{col}: {accepted[col].isnull().sum()}')

loan_amnt: 33
issue_d: 33
title: 23358
last_fico_range_high: 33
dti: 1744
zip_code: 34
addr_state: 33
emp_length: 146940
policy_code: 33

In [6]:
# rejected
for col in rejected.columns:
    print(f'{col}: {rejected[col].isnull().sum()}')

Amount Requested: 0
Application Date: 0
Loan Title: 29
Risk_Score: 266944
Debt-To-Income Ratio: 0
Zip Code: 44
State: 21
Employment Length: 22340
Policy Code: 0

accepted df cleaning

In [7]:
accepted_df = accepted.copy()

accepted_df['title'] = accepted_df['title'].str.replace('_', ' ').str.lower()

accepted_df['dti'] = accepted_df['dti']/100

accepted_df.dropna(subset = ['loan_amnt', 'issue_d'], inplace = True)
accepted_df['year'] = accepted_df['issue_d'].str[-4:].astype('int')

accepted_df['status'] = 1

accepted_df.drop(['issue_d'],axis = 1, inplace = True)

accepted_df = accepted_df.rename(columns = {'loan_amnt':'amount', 'title':'title',
                                            'last_fico_range_high':'risk_score','zip_code':'zip', 'addr_state':'state',
                                            'emp_length':'length_of_emp','dti':'debt_to_income_ratio',
                                            'policy_code':'policy_code','year':'year','status':'status'})

In [8]:
accepted_df.sample(5)

,amount,title,risk_score,debt_to_income_ratio,zip,state,length_of_emp,policy_code,year,status
1698739,5950.0,debt consolidation,609.0,0.2225,794xx,TX,2 years,1.0,2017,1
1276047,10000.0,debt consolidation,569.0,0.1169,605xx,IL,1 year,1.0,2014,1
1996157,5200.0,debt consolidation,734.0,0.1309,532xx,WI,< 1 year,1.0,2016,1
1135765,15000.0,debt consolidation,544.0,0.1811,115xx,NY,6 years,1.0,2014,1
1428331,3000.0,credit card refinancing,739.0,0.2279,955xx,CA,5 years,1.0,2018,1

In [9]:
accepted_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2260668 entries, 0 to 2260698
Data columns (total 10 columns):
 #   Column                Dtype
---  ------                -----
 0   amount                float64
 1   title                 object
 2   risk_score            float64
 3   debt_to_income_ratio  float64
 4   zip                   object
 5   state                 object
 6   length_of_emp         object
 7   policy_code           float64
 8   year                  int32
 9   status                int64
dtypes: float64(4), int32(1), int64(1), object(4)
memory usage: 181.1+ MB

rejected df cleaning

In [10]:
rejected_df = rejected.copy()

rejected_df['Loan Title'] = rejected_df['Loan Title'].str.replace('_', ' ').str.lower()

rejected_df['year'] = rejected_df['Application Date'].str[-4:].astype('int')

rejected_df['debt_to_income_ratio'] = rejected_df['Debt-To-Income Ratio'].str.replace('%','').astype('float')/100

rejected_df['status'] = 0

rejected_df = rejected_df.drop(['Application Date','Debt-To-Income Ratio'], axis = 1)

rejected_df = rejected_df.rename(columns = {'Amount Requested':'amount', 'Loan Title':'title',
                                            'Risk_Score':'risk_score','Zip Code':'zip', 'State':'state',
                                            'Employment Length':'length_of_emp',
                                            'Policy Code':'policy_code','year':'year','status':'status'})

In [11]:
rejected_df.sample(5)

,amount,title,risk_score,zip,state,length_of_emp,policy_code,year,debt_to_income_ratio,status
1008639,10000.0,house,NaN,785xx,TX,< 1 year,0,2016,0.0129,0
252432,10000.0,major purchase,711.0,456xx,OH,< 1 year,0,2011,0.1334,0
61609,10000.0,education and schooling,NaN,959xx,CA,< 1 year,0,2009,-0.0100,0
195437,16000.0,car,734.0,300xx,GA,8 years,0,2010,0.2679,0
382654,20000.0,car,0.0,914xx,CA,< 1 year,0,2011,0.0108,0

In [12]:
rejected_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 10 columns):
 #   Column                Non-Null Count    Dtype
---  ------                --------------    -----
 0   amount                1048575 non-null  float64
 1   title                 1048546 non-null  object
 2   risk_score            781631 non-null   float64
 3   zip                   1048531 non-null  object
 4   state                 1048554 non-null  object
 5   length_of_emp         1026235 non-null  object
 6   policy_code           1048575 non-null  int64
 7   year                  1048575 non-null  int32
 8   debt_to_income_ratio  1048575 non-null  float64
 9   status                1048575 non-null  int64
dtypes: float64(3), int32(1), int64(2), object(4)
memory usage: 76.0+ MB

accepted_df + rejected_df

In [13]:
lc_df = pd.concat([accepted_df, rejected_df], axis = 0)

In [14]:
lc_df.sample(5)

,amount,title,risk_score,debt_to_income_ratio,zip,state,length_of_emp,policy_code,year,status
584752,4200.0,credit card refinancing,714.0,0.1743,403xx,KY,2 years,1.0,2017,1
48263,10000.0,at home children's clothing business,622.0,0.1347,018xx,MA,9 years,0.0,2009,0
495774,4500.0,credit card refinancing,634.0,0.1573,460xx,IN,6 years,1.0,2018,1
755427,3000.0,other,471.0,0.0156,925xx,CA,< 1 year,0.0,2012,0
884491,2500.0,debt consolidation,NaN,-0.0100,170xx,PA,< 1 year,0.0,2016,0

adding region columns

In [15]:
region = pd.read_csv('../data/states.csv')

In [16]:
region.sample(5)

            State State Code     Region            Division
2        Arkansas         AR      South  West South Central
28   North Dakota         ND    Midwest  West North Central
30  New Hampshire         NH  Northeast         New England
23      Minnesota         MN    Midwest  West North Central
9         Florida         FL      South      South Atlantic

In [17]:
lc_df = lc_df.merge(region, how = 'left', left_on = 'state', right_on = 'State Code')

In [18]:
lc_df.drop(['zip','State','State Code'], axis = 1, inplace = True)

In [19]:
lc_df.columns = lc_df.columns.str.lower()

In [20]:
for col in lc_df.columns:
    print(f'{col}: {lc_df[col].isnull().sum()}')

amount: 0
title: 23354
risk_score: 266944
debt_to_income_ratio: 1711
state: 21
length_of_emp: 169247
policy_code: 0
year: 0
status: 0
region: 21
division: 21

In [21]:
lc_df.dropna(subset = ['state'], inplace = True)

In [22]:
lc_df.sample(5)

,amount,title,risk_score,debt_to_income_ratio,state,length_of_emp,policy_code,year,status,region,division
1613621,12000.0,wedding loan,684.0,0.1909,FL,5 years,1.0,2011,1,South,South Atlantic
731039,30000.0,home buying,544.0,0.1345,TX,10+ years,1.0,2016,1,South,West South Central
2345570,25000.0,small business,469.0,1.1043,MN,< 1 year,0.0,2009,0,Midwest,West North Central
3286917,7000.0,car,NaN,0.0000,NY,< 1 year,0.0,2016,0,Northeast,Middle Atlantic
2903587,5000.0,other,497.0,0.0000,NY,< 1 year,0.0,2012,0,Northeast,Middle Atlantic

In [23]:
lc_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3309222 entries, 0 to 3309242
Data columns (total 11 columns):
 #   Column                Dtype
---  ------                -----
 0   amount                float64
 1   title                 object
 2   risk_score            float64
 3   debt_to_income_ratio  float64
 4   state                 object
 5   length_of_emp         object
 6   policy_code           float64
 7   year                  int32
 8   status                int64
 9   region                object
 10  division              object
dtypes: float64(4), int32(1), int64(1), object(5)
memory usage: 290.3+ MB

export

In [24]:
lc_df.to_csv('../data/lc_cleaned.csv', index = False)